vetis_api/templates/vetis_api/xml/GetSubproductByGuid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:bs="http://api.vetrf.ru/schema/cdm/base"
    xmlns:ws="http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2">
    <soapenv:Header />
    <soapenv:Body>
        <ws:getSubProductByGuidRequest>
            <bs:guid>{{ vetis_request.subproduct_guid }}</bs:guid>
        </ws:getSubProductByGuidRequest>
    </soapenv:Body>
</soapenv:Envelope>